{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 4096, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_16", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [32, 2, 64]}, "name": "reshape_2", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_8", "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_17", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_18", "inbound_nodes": [[["conv2d_transpose", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_19", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_1", "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_20", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_10", "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_21", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_2", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_22", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_22", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_11", "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_23", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_23", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_3", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_24", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_24", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "dtype": "float32", "target_shape": [32, 32, 2, 32]}, "name": "reshape_3", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_8", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_8", "inbound_nodes": [[["reshape_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_25", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_25", "inbound_nodes": [[["conv3d_8", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose", "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_26", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_26", "inbound_nodes": [[["conv3d_transpose", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_9", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_9", "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_27", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_27", "inbound_nodes": [[["conv3d_9", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose_1", "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_28", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_28", "inbound_nodes": [[["conv3d_transpose_1", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_10", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_10", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_29", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_29", "inbound_nodes": [[["conv3d_10", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose_2", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_30", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_30", "inbound_nodes": [[["conv3d_transpose_2", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_11", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_11", "inbound_nodes": [[["activation_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_31", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_31", "inbound_nodes": [[["conv3d_11", 0, 0, {}]]]}, {"class_name": "Conv3DTranspose", "config": {"name": "conv3d_transpose_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3, 3], "strides": [1, 1, 2], "padding": "same", "data_format": "channels_last", "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv3d_transpose_3", "inbound_nodes": [[["activation_31", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_32", "trainable": true, "dtype": "float32", "activation": "selu"}, "name": "activation_32", "inbound_nodes": [[["conv3d_transpose_3", 0, 0, {}]]]}, {"class_name": "Conv3D", "config": {"name": "conv3d_12", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [3, 3, 3], "strides": [1, 1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3d_12", "inbound_nodes": [[["activation_32", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_33", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "activation_33", "inbound_nodes": [[["conv3d_12", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_4", "trainable": true, "dtype": "float32", "target_shape": [32768, 5]}, "name": "reshape_4", "inbound_nodes": [[["activation_33", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["reshape_4", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "conv2d_10/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_11/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_3/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3d_10/kernel", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "conv3d_10/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3d_11/kernel", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "conv3d_11/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3d_12/kernel", "shape": [3, 3, 3, 64, 5], "dtype": "float32"}, {"name": "conv3d_12/bias", "shape": [5], "dtype": "float32"}, {"name": "conv3d_8/kernel", "shape": [3, 3, 3, 32, 64], "dtype": "float32"}, {"name": "conv3d_8/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3d_9/kernel", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "conv3d_9/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3d_transpose/kernel", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "conv3d_transpose/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3d_transpose_1/kernel", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "conv3d_transpose_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3d_transpose_2/kernel", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "conv3d_transpose_2/bias", "shape": [64], "dtype": "float32"}, {"name": "conv3d_transpose_3/kernel", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "conv3d_transpose_3/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [2, 4096], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [4096], "dtype": "float32"}]}]}